<script>
    import Services from "../lib/Services.svelte";
    import Map from "../lib/Map.svelte";
    import WorkTimes from "../lib/WorkTimes.svelte";
</script>

<div class="margined-center">
    <Services />
</div>
<div class="margined-center">
    <div class="text">
        <h3>Кардилогичен преглед в Кардиологичен Център Бургас:</h3>
        <ul>
            <li>профилактичен или при оплаквания от лесна уморяемост и задух при усилие, намален физически капацитет, болка, стягане или тежест в гърдите, усещане за сърцебиене, отоци по долни крайници, фамилна обремененост за сърдечни заболявания</li>
            <li>след преболедуване на Ковид, особено ако има някои от гореизброените оплаквания</li>
            <li>при известни хронични сърдечни заболявания</li>
        </ul>

        <h3>Ехокардиография</h3>
        <p>Обичайният преглед, освен стандартните изследвания - като преслушване, измерване на кръвно налягане и ЕКГ, задължително включва и подробна ехокардиография, която дава обилна информация за размерите и формата на сърцето, помпената му функция, еластичността и виталитета на стените, състоянието на клапния апарат, големите съдове, перикарда, възрастови промени или такива, настъпили заради преживени инфекциозни заболявания, дългогодишна хипертония, излагане на вредни фактори. Получената информация позволява да се прецени необходимостта от допълнителни изследвания или лечение.</p>

        <h3>Преглед, включващ и провеждане на Работна ЕКГ проба(РЕП или стрес-тест).</h3>
        <p>Това е най-безопасният и достъпен начин, за изследване на артериите, снабдяващи сърдечния мускул с кръв. Този преглед е задължителен при хора с рискови фактори за исхемична болест на сърцето - затлъстяване (особено коремно), тютюнопушене, артериална хипертония, завишен холестерол, захарен диабет, фамилна обремененост. 
            Паралелно с оценката на коронарните артерии се получава нужната информация и за поведението на артериалното налягане при усилие и дали има склонност към артериална хипертония, както и за физическия капацитет на пациента. 
            Такъв тип прегледи трябва регулярно да се провеждат и при пациенти с вече известна коронарна болест, с имплантиран един или повече стентове.</p>

        <h3>Холтер ЕКГ за 48 часа.</h3>
        <p>Записва ЕКГ за съответния период. Това е незаменимо изследване, когато има някакви нарушения на сърдечния ритъм. Усещане за прескачане на сърцето, сърцебиене, забавяне на пулса или епизодични, резки ускорявания могат да бъдат диагностицирани единствено след като са записани на ЕКГ, което позволява да се прецени дали става въпрос за истинска аритмия, която има нужда от лечение или за безобидни функционални промени.</p>
    </div>
</div>

<WorkTimes />

<Map />

<style lang="scss">
    @import "../style.scss";

    .text {
        font-family: "Open Sans", sans-serif;
        color: hsl(0, 0, 30%);
        border-radius: 15px;
        background-color: hsl(218, 67%, 98%);
        box-shadow: 2px 2px 3px $gray;
        margin-bottom: 40px;
        padding: 50px;

        h3 {
            font-size: 1.2rem;
            color: $darker_blue;
            // color: hsl(0, 0, 23%);
        }

        p {
            font-size: 1rem;
        }
    }

    .margined-center {
        margin: 0 15vw;
    }

    @media only screen and (max-width: 550px) {
        .margined-center {
            margin: 30px 5vw;
        }
    }

    @media only screen and (max-width: 450px) {
        .text {
            padding: 10px 20px;
        }
    }

    @media only screen and (max-width: 450px) {
        li {
            font-size: 0.95rem;
            margin-left: -20px;
        }
        .text {
            p {
                font-size: 0.95rem;
            }

            h3 {
                font-size: 1.1rem;
            }
        }
    }
</style>

